app/controllers/car_model_controller.rb

SELECT `car_models`.* FROM `car_models`
---
    def list
        @car_models = CarModel.all

SELECT  `car_models`.* FROM `car_models` WHERE `car_models`.`id` = 7 LIMIT 1
---
    def show
        @car_model = CarModel.find(params[:id])