app/controllers/car_brand_controller.rb

SELECT `car_brands`.* FROM `car_brands`
---
    def list
        @car_brands = CarBrand.all

SELECT  `car_brands`.* FROM `car_brands` WHERE `car_brands`.`id` = 9 LIMIT 1
---
    def show
        @car_brand = CarBrand.find(params[:id])